[
    [
        "Czym jest certyfikat SSL",
        "Certyfikat zabezpiecza połączenie i przesył danych pomiędzy przeglądarką, a serwerem, na którym umieszczona jest witryna."
    ],

    [
        "Do czego służy certyfikat",
        "Certyfikat służy do ochrony danych przesyłanych pomiędzy witryną, a serwerem"
    ],

    [
        "Jak działa certyfikat",
        "Certyfikat szyfruje dane przesyłane pomiędzy witryną, a serwerem dzięki czemu są one bezpieczne"
    ],

    [
        "Czy ten certyfikat będzie pokazywał zieloną kłódkę",
        "Każdy certyfikat po zainstalowaniu posiada zieloną kłódkę."
    ],

    [
        "Co oznacza zielona kłódka przy adresie strony",
        "Zielona kłódka na stronie oznacza, że jest ona zabezpieczona certyfikatem"
    ],

    [
        "Co oznacza zielona kłódka przy adresie strony",
        "Jeśli na stronie, przy jej adresie wyświetla się zielona kłódka oznacza, że zainstalowany jest na niej certyfikat"
    ],

    [
        "Jak przekierować domenę na mój serwer, chce korzystać na nim z poczty i strony WWW",
        "Aby przekierować domenę na serwer należy ustawić jej odpowiednie adresy DNS."
    ],

    [
        "Skąd domena wie, że ma pobrać pliki z mojego serwera",
        "Domena kieruje na odpowieni serwer dzięki adresom DNS"
    ],

    [
        "Jak przekierować domenę na mój serwer, chce korzystać na nim z poczty i strony WWW",
        "Przekierowanie domeny na serwer należy zdefiniować za pomocą adresów DNS"
    ],

    [
        "Gdzie mogę ustawić przekierowanie URL",
        "Przekierowanie URL należy wykonać z poziomu serwera."
    ],

    [
        "Jak przekierować domenę na inny adres",
        "Aby przekierować domenę na inny adres należy ustawić dla niej przekierowanie URL"
    ],

    [
        "Czym jest przekierowanie URL",
        "Za pomocą przekierowania URL możemy przekierować domenę na inny adres"
    ],

    [
        "Jak moge zalogować się do mojej skrzynki mailowej",
        "Z poczty można korzystać za pomocą klienta w przeglądarce lub programu pocztowego."
    ],

    [
        "Czy muszę mieć specjalny program do poczty",
        "Nie, logowanie do skrzynki można wykonać przez przeglądarke www"
    ],

    [
        "Jak zalogować się do skrzynki poza przeglądarką",
        "Aby korzystać ze skrzynki bez przeglądarki można skonfigurwać ją w programie pocztowym"
    ],

    [
        "Co muszę zrobić, aby mieć skrzynkę @mojenazwisko",
        "Aby posiadać pocztę w swojej domenie należy ją zarejestrować."
    ],

    [
        "Czy mogę posiadać skrzynkę z nazwą mojej domeny",
        "Jak najbardziej założenie skrzynki we własnej domenie jest możliwe"
    ],

    [
        "Co zrobić, żeby mieć swoją strone internetową",
        "Na początek należy zarejestrować swoją domenę oraz zakupić dla niej serwer"
    ],

    [
        "Od czego zależy cena domeny",
        "Koszty domeny zależne są od jej rozszeżenia"
    ],

    [
        "Ile kosztuje rejestracja domeny",
        "Koszt rejestracji domeny zależny jest od jej rozszeżenia."
    ],

    [
        "Ile kosztuje utrzymanie domeny",
        "Koszt odnowienia domeny domeny zależny jest od jej rozszeżenia."
    ],

    [
        "Jak mogę przenieść domenę do innej firmy",
        "W celu transferu domeny do innej firmy należy na początku uzyskać jej kod authinfo."
    ],

    [
        "Chce mieć swoją pocztę, jak to zrobić",
        "Aby korzystać ze swojej skrzynki pocztowej należy najpierw utworzyć ją po stronie serwera."
    ],

    [
        "Kiedy domena zacznie działać po zmianie DNS",
        "Po zmianie adresów DNS należy odczekać 72h na ich propagacje w sieci."
    ],

    [
        "Czy po zmianie DNS muszę odczekać",
        "Aby zmiany były widoczne w sieci należy odczekać czas ich propagacji, może to potrwać do 72h."
    ],

    [
        "Co zrobić by posiadać sowją domenę",
        "Aby skorzystać z domeny należy ją zarejestrować"
    ],

    [
        "Czy mogę przetestować domenę",
        "Domena nie posiada okresu testowego."
    ],

    [
        "Jak sprawdzić czyja jest domena",
        "Dane właściciela domeny można znaleźć w bazie WHOIS"
    ],

    [
        "Gdzie mogę przekierować domenę na inny serwer",
        "Adresy DNS domeny należy zmienić z poziomu panelu firmy, w której jest zarejestrowana"
    ],

    [
        "Czym jest rozszeżenie domeny",
        "Rozszeżnie domeny to jej 'końcówka' np. .pl; .com; .com.pl; i ty podobne."
    ],

    [
        "Jakie są rodzaje domen",
        "Domeny dzielą się na krajowe, regionalne, funkcjonalne oraz globalne."
    ],

    [
        "Na jaki czas mogę zarejestrować domenę",
        "Okres ważności domeny to minimalnie rok lub jego wielokrotność."
    ],

    [
        "Jak nazwya się proces zmiany danych właściciela domeny",
        "Zmiana danych abonenta domeny to E-cesja"
    ],

    [
        "Ile mogę mieć subdomen",
        "Dla każdej domeny można stworzyć nielimitowaną ilość subdomen"
    ],

    [
        "Czy muszę mieć swój adres IP żeby móc zainstalować certyfikat",
        "Obecnie certyfikaty nie wymagają dedykowanych adresów IP"
    ],

    [
        "Kupiłem certyfikat, co teraz",
        "Po otrzymaniu certyfikatu SSL należy dokonać jego instalacji na serwerze"
    ],

    [
        "Gdzie mogę kupić certyfikat",
        "Certyfikat SSL można zamówić na naszej stornie internetowej"
    ],

    [
        "Co to jest wildcard",
        "Certyfikaty SSL typu wildcard chronią domenę główną oraz dodane subdomeny."
    ],

    [
        "Co to jest whois",
        "Baza Whois – jest to zbiór wszystkich domen internetowych wraz z danymi właściciela domeny."
    ],

    [
        "Nie chce żeby moje dane były widoczne w bazie whois",
        "Dane we Whois są widoczne automatycznie i nie dla wszystkich rodzajów domen można je ukryć."
    ],

    [
        "Skąd pobierane są dane do bazy whois",
        "Dane widoczne w bazie Whois wprowadzane są podczas rejestracji domeny przez jej właściciela."
    ],

    [
        "Czy w przypadku domen .pl dane są widoczne w bazie whois",
        "Dla domen polskich np. .pl dane we Whois osób prywatnych są automatycznie ukryte"
    ],

    [
        "Czy w przypadku domen .com dane są widoczne w bazie whois",
        "Dla domen globalnych dane we Wois np. .com dane można ukryć"
    ],

    [
        "Czy w przypadku domen .eu dane są widoczne w bazie whois",
        "Dla domen .eu można ukryć dane we Whois - oprócz adresu e-mail, ten pozostanie zawsze widoczny."
    ],

    [
        "Co to znaczy, że domena jest w kwarantannie",
        "Kwarantanna oznacza, że domena jest zatrzymana do czasu jej całkowitego uwolnienia do puli domen wolnych."
    ],

    [
        "Ile domena będzie w kwarantannie",
        "Okres czasu, w którym domena znajduje się w statusie kwarantanny jest zależny od rodzaju zakupionej domeny."
    ],

    [
        "Czy ktoś może mi ukraść domenę i ją odnowić",
        "Sama domena może być odnowiona jedynie przez obecnego właściciela."
    ],

    [
        "Kupiłem domenę, co teraz",
        "Po zakupieniu domeny należy ją skierować na serwer, aby wyświetlała się strona WWW oraz działała poczta w nazwie domeny."
    ],

    [
        "Po co ustawia się adresy DNS",
        "DNSy ustawia się w celu skierowania domeny, na konkretny serwer."
    ],

    [
        "Zmieniłem adresy DNS, ale to jeszcze nie działa.",
        "Zmiana DNSów wywołuje propagację, która trwa około 24 godziny (do 72 godziny)."
    ],

    [
        "Czy propagacja wpłynie na działanie mojej domeny",
        "W czasie propagacji domena nie będzie poprawnie funkcjonować."
    ],

    [
        "Czy mogę zarejestrować domenę innego kraju",
        "W przypadku domen narodowych zasady rejestracji są zależne od wybranej końcówki domeny."
    ],

    [
        "CZym jest subdomena",
        "Subdomena to część domeny, która została dodana do serwera."
    ],

    [
        "Jaką subdomenę mogę założyć",
        "Można utworzyć dowolną subdomenę w domenie głównej np. abc.nazwa-domeny.pl."
    ],

    [
        "Czy mogę mieć pod subdomeną inną strone internetową",
        "Każda subdomena może wyświetlać inną stronę WWW."
    ],

    [
        "Co to jest kod authinfo",
        "Kod authinfo jest to unikalny kod zezwalający na transfer domeny do innego operatora."
    ],

    [
        "Skąd wziąć kod authinfo",
        "Kod authinfo należy uzyskać od obecnego rejestratora domeny, czyli firmy, w której opłaca się obecnie domenę"
    ],

    [
        "Ile ważny jest kod authinfo",
        "Kod authinfo jest ważny przez 30 dni od momentu uzyskania go od operatora."
    ],

    [
        "Czy kod authinfo ma swoją ważność",
        "Kod authinfo jest ważny przez 30 dni od momentu uzyskania go od operatora."
    ],

    [
        "Moja domena wygasła, czy mogę ją przenieść",
        "Tak, można przetransferować domenę, która wygasła. Będzie to transfer domeny z odnowieniem"
    ],

    [
        "Zainicjowałem transfr, gdzie dostane link do potwierdzenia",
        "W przypadku zainicjowania transferu jest przesyłany link transferowy na adres administracyjny domeny."
    ],

    [
        "Czy mogę zaktualizować dane przypisane do domeny",
        "Zmiany danych, w tym adresu e-mail, na które dokonana była rejestracja domeny można dokonać w dowolnym momencie."
    ],

    [
        "Czym jest cesja",
        "Cesja jest to zmiana właściciela usługi."
    ],

    [
        "Jak mogę połączyć się z serwerem za pomocą FTP",
        "Połączenie FTP można nawiązać dowolnym klientem FTP, jak Total Commander czy FileZilla."
    ],

    [
        "Jaki port powinienem wpisać podczas łączenia z FTP",
        "Port dla połączeń FTP to 21"
    ],

    [
        "Otrzymałem błąd 1045, dlaczego",
        "Jeżeli podczas logowania do bazy danych wyświetli nam się błąd 1045, oznacza to, iż podaliśmy błędny login użytkownika bazy lub jego hasło."
    ],

    [
        "Ile osób może korzystać z jednej skrzynki w tym samym momencie",
        "Liczba jednoczesnych połączeń do serwera POP3/IMAP/SMTP wynosi 50."
    ],

    [
        "Ilu mogę wpisać odbiorców do jednej wiadomości",
        "Limit odbiorców jednej wiadomości, wynosi on 100 odbiorców."
    ],

    [
        "Muszę wysłać jedną wiadomość do dużej ilości osób, co zrobić",
        "W przypadku gdy chcemy wysłać wiadomość do większej liczby osób zalecamy podzielenie tej wysyłki na kilka partii."
    ],

    [
        "Jak duży plik mogę przesłać pocztą",
        "Maksymalny rozmiar załączników w jednej wiadomości to 200mb."
    ],

    [
        "Czy mogę zmienić limit ilości odbiorców wiadomości",
        "Jest to stała wartość, bez możliwości zmiany."
    ],

    [
        "Ile maili dziennie mogę wysłać",
        "Limit wysyłanych wiadomości wynosi 5000 na dobę."
    ],

    [
        "Co się stanie gdy wyśle zbyt dużo wiadomościu w ciągu jednego dnia",
        "W przypadku przekroczenia limitu wysyłanych wiadomości dalsza wysyłka wiadomości nie jest możliwa."
    ],

    [
        "Co oznacza błąd 403",
        "Błąd 403 oznacza brak dostępu do witryny lub konkretnych je plików"
    ],

    [
        "Co oznacza błąd 404",
        "Błąd 404 świadczy o odwołaniu się strony do nieistniejącej lokalizacji/pliku."
    ],

    [
        "Dlaczego mam błąd 500",
        "Błąd 500 pojawia się często w przypadku przeglądarek Chrome, zaś biała strona wyświetla się z reguły w Firefoxie."
    ],

    [
        "Co oznacza błąd 500",
        "Błąd 500 powoduje problem ze skryptem."
    ],
    [
        "Kiedy otrzymam fakturę VAT",
        "Faktury VAT są wystawiane automatycznie po zaksięgowaniu wpłaty w naszym systemie"
    ],

    [
        "Mam błędne dane na fakturze VAT, co mogę z tym zrobić",
        "Po wystawieniu faktury VAT można poprawić dane notą korygującą."
    ],

    [
        "Gdzie znajde swoej faktury VAT",
        "Wystawione faktury VAT można pobrać w dowolnym momencie w pliku .pdf z Panelu Klienta"
    ],

    [
        "Gdzie mogę zalogować się do skrzynki mailowej",
        "Głównym adresem, pod którym możesz zalogować się do poczty jest: poczta-mailowa.pl"
    ],

    [
        "Czym są filtry poczty",
        "Filtry poczty służą do blokowania niechcianych wiadomości."
    ],

    [
        "Czym są filtry poczty",
        "Filtry poczty pozwalają blokować wiadomości na podstawie kilku różnych kryteriów"
    ],

    [
        "Jak przekierować pocztę na inny serwer",
        "Przekierowanie poczty należy wykonać za pomocą rekordów MX"
    ],

    [
        "Jak ustawić serwer poczty wychodzącej",
        "Serwer poczty wychodzącej: Protokół połączenia: SMTP. Port: 587 lub 465(SSL)"
    ],

    [
        "Jak ustawić serwer poczty przychodzącej",
        "Serwer poczty przychodzącej: Protokół połączenia: IMAP. Port: 143 lub 993(SSL) lub Protokół połączenia: POP3. Port: 110 lub 995(SSL)"
    ],

    [
        "Jaki jest port protokołu SMTP",
        "587 lub 465(SSL)"
    ],

    [
        "Jaki jest port protokołu IMAP",
        "143 lub 993(SSL)"
    ],

    [
        "Jaki jest port protokołu POP3",
        "110 lub 995(SSL)"
    ],
    [
        "Co to jest POP3",
        "Jest to protokół służący odczytywaniu poczty."
    ],
    [
        "Co to jest IMAP",
        "Jest to protokół służący odczytywaniu poczty."
    ],
    [
        "Co to jest SMTP",
        "Jest to protokół służący wysyłaniu poczty."
    ],
    [
        "Jakie są historyczne szyfry",
        "Enigma, szyfr podstawieniowy, szyfr przestawieniowy, Szachownica Polibiusza, Gaderypoluki, szyfr zmiennoprzesuwny, szyfr liczbowy"
    ],
    [
        "Co to szyfr symetryczny",
        "Szyfry symetryczne używają tych samych sekretnych kluczy do szyfrowania tekstu jawnego i deszyfrowania tekstu ukrytego."
    ],
    [
        "Co to szyfr strumieniowy",
        "Szyfry strumieniowe operują na ciągłym strumieniu znaków tekstu jawnego. Wiadomości nie są dzielone na mniejsze bloki."
    ],
    [
        "Co to szyfr blokowy",
        "Szyfry blokowe operują na większych partiach danych (nazywanych blokami), które szyfrowane są kolejno, jeden po drugim."
    ],
    [
        "Co to kod odpowiedzi HTTP",
        "To numeryczna dana wysyłana przez serwer HTTP do aplikacji klienta."
    ],
    [
        "Co to HTTP",
        "HTTP jest jednym z protokołów przesyłania danych przez internet, używany przy przeglądaniu stron internetowych."
    ],
    [
        "Co to szyfr asymetryczny",
        "W swoim działaniu szyfr ten wykorzystuje dwa klucze, jeden do szyfrowania wiadomości, a drugi do deszyfrowania."
    ],
    [
        "Co to jest usługa z uprawnieniami administracyjnymi",
        "Jeśli zalogujesz się do usługi z uprawnieniami standardowymi, będziesz mógł zarządzać usługą, do której jesteś zalogowany."
    ],
    [
        "Jak dodać skrzynkę e-mail na serwerze w home.pl",
        "Przejdź do sekcji Usługi, a następnie Konfiguracja usługi i wybierz Adres E-mail"
    ],
    [
        "Ile trwa aktywacja usługi hostingowej",
        "Nie trzeba czekać – aktywacja usługi hostingowej powinna nastąpić w ciągu zaledwie kilkudziesięciu sekund od momentu złożenia zamówienia."
    ],
    [
        "Do czego przydaje sie panel hostingowy",
        "W panelu można jednak szybko utworzyć własną skrzynkę pocztową, podpiąć nową domenę, utworzyć konto FTP, założyć bazę danych, sprawdzić statystyki oglądalności stron www i wykonać od ręki wiele innych czynności."
    ],
    [
        "Co to multidomena",
        "Multidomena umożliwia zarządzanie wieloma stronami www w ramach tego samego hostingu."
    ],
    [
        "Zliczanie obciążenia procesora – jak to działa",
        "System zliczania obciążenia procesora działa analogicznie do zliczania limitu transferu miesięcznego."
    ],
    [
        "Co się dzieje po wyczerpaniu miesięcznego limitu transferu",
        "W przypadku przekroczenia limitu, blokujemy usługę aż do 1 dnia kolejnego miesiąca."
    ],
    [
        "Co to propagacja DNS",
        "Zmieniając wpisy w DNS dla domeny, należy wziąć pod uwagę to, że serwery z opóźnieniem będą kierować do konkretnej domeny."
    ],
    [
        "Z jaką częstotliwością jest realizowany back-up danych",
        "Back-upy automatycznie wykonują się co noc, a następnie są przechowywane w innym miejscu przez siedem dób."
    ],
    [
        "Zamówiłem usługę na okres testowy. Czy mogę z niej zrezygnować",
        "Przez 14 dni można bez zobowiązań korzystać z naszej usługi."
    ],
    [
        "Do czego służy FTP",
        "FTP (File Transfer Protocol) jest to protokół, umożliwiający transmisję plików, pomiędzy dwoma komputerami, przy użyciu sieci Internet."
    ],
    [
        "Co to jest alias",
        "Alias pocztowy to po prostu inna nazwa przypisana do danego konta e-mail."
    ],
    [
        "Co to jest lista pocztowa",
        "Lista pocztowa służy do jednoczesnego rozsyłania wiadomości e-mail na wiele różnych kont pocztowych."
    ],
    [
        "Czy jestem chroniony przed SPAM-em",
        "Na wszystkich pakietach hostingowych jest zainstalowany mechanizm antyspamowy."
    ],
    [
        "Czy mogę zwiększyć limit powierzchni dyskowej",
        "Zwiększenie powierzchni dyskowej dla Twojego hostingu jest dostępne przez panel."
    ],
    [
        "Ile czasu trwa uruchomienie serwera",
        "Uruchomienie serwera następuje natychmiast po akceptacji płatności."
    ]
]
